4) For each of these applicable properties, except for rdf:type, which different values do they take globally for all those instances?

SELECT DISTINCT ?properties ?values
WHERE{
	?s rdf:type <http://dbpedia.org/ontology/Politician>.
	?s ?properties ?values
	FILTER (?properties != rdf:type)
}
LIMIT 100


Resultado
https://dbpedia.org/sparql?default-graph-uri=http%3A%2F%2Fdbpedia.org&query=SELECT+DISTINCT+%3Fproperties+%3Fvalues%0D%0AWHERE%7B%0D%0A%09%3Fs+rdf%3Atype+%3Chttp%3A%2F%2Fdbpedia.org%2Fontology%2FPolitician%3E.%0D%0A%09%3Fs+%3Fproperties+%3Fvalues%0D%0A%09FILTER+%28%3Fproperties+%21%3D+rdf%3Atype%29%0D%0A%7D%0D%0ALIMIT+100&format=text%2Fhtml&timeout=30000&signal_void=on&signal_unconnected=on